import streamlit as st

mark = """
<style>
[data-testid="stToolbar"] {
    visibility: hidden;
}
</style>
"""
st.markdown(mark, unsafe_allow_html=True)
st.header("Dusit Thani", divider="rainbow")
st.image("assets/images/dusit.jpg")
st.write("""สมรภูมิธุรกิจโรงแรมไทยเผชิญการแข่งขันอันท้าทาย นักลงทุนต่างผนึกเชนโรงแรมต่างประเทศนำแบรนด์ดังเข้ามาขยายธุรกิจ เปิดโรงแรมใหม่ทั่วหัวเมืองท่องเที่ยวอย่างคึกคัก นับเป็นโจทย์ใหญ่ของ “กลุ่มดุสิตธานี” เชนโรงแรมสัญชาติไทย เจ้าของโรงแรมระดับตำนาน “ดุสิตธานี กรุงเทพ” บนไพร์มโลเคชัน หัวมุมถนนสีลม-พระราม 4 หลังยืนหยัดครองใจลูกค้าทั้งคนไทย และนักท่องเที่ยวต่างชาติ รองรับแขกคนดังระดับโลกมายาวนานกว่า 50 ปี

กระทั่งการเปลี่ยนแปลงครั้งสำคัญมาถึง! โรงแรมดุสิตธานี กรุงเทพ ประกาศปิดปรับปรุงครั้งใหญ่เมื่อเดือนม.ค.2562 พัฒนาโฉมใหม่สู่โรงแรมระดับแฟลกชิป รับโลกการท่องเที่ยวยุคใหม่ ล่าสุดกลุ่มดุสิตธานีเคาะฤกษ์เปิดให้บริการอย่างเป็นทางการวันที่ 27 ก.ย.2567 พร้อมกลับมาเป็นเสาหลักในการสร้างรายได้แก่กลุ่มดุสิตธานี ซึ่งก่อนตัดสินใจรื้อสร้างใหม่ โรงแรมแห่งนี้เคยสร้างรายได้ปีละประมาณ 800 ล้านบาท
ประกอบกับช่วง 5 ปีที่ผ่านมา ที่โรงแรมดุสิตธานี กรุงเทพ ต้องปิดให้บริการชั่วคราว ทำเลโดยรอบมีโรงแรมแบรนด์หรูเชนต่างประเทศเข้ามาเปิดใหม่ต่อเนื่อง เช่น โรงแรมโรสวูด กรุงเทพ, โรงแรมสินธร เคมปินสกี้ กรุงเทพ, โรงแรม เดอะ สแตนดาร์ด กรุงเทพ และอื่นๆ ร่วมวงช่วงชิงตลาด มุมมองของ “ชนินทธ์ โทณวณิก” รองประธานกรรมการ และประธานคณะกรรมการบริหาร บริษัท ดุสิตธานี จำกัด (มหาชน) กล่าวไว้ก่อนหน้านี้ว่า การกลับมาของโรงแรมดุสิตธานี กรุงเทพ มาจากการมองหลักใหญ่ “ต้องมีแบรนด์ของคนไทยสู้กับต่างประเทศ” และหวังว่าโครงการนี้จะเป็น “แฟลกชิป” ของกลุ่มดุสิตธานี รวมถึงกลุ่มธุรกิจโรงแรมไทยในการสู้กับแบรนด์โรงแรมเชนต่างประเทศ""")

with open("assets/docs/Presentation Note.docx", "rb") as file:
    button = st.download_button(
        label="Dusit",
        data=file,
        file_name="rb.docx",
        mime="application/vnd.openxmlformats-officedocument.wordprocessingml.document"
        )
